[
    {
        "id": "",
        "text": "You are in a dark room. You can't see anything.",
        "choices": [
            {
                "text": "Feel around for an object",
                "nextNodeID": "0"
            },
            {
                "text": "Shout for help",
                "nextNodeID": "1"
            },
            {
                "text": "Wait and listen carefully",
                "nextNodeID": "2"
            }
        ]
    },
    {
        "id": "0",
        "text": "You find a key.",
        "choices": [
            {
                "text": "Explore further",
                "nextNodeID": "00"
            },
            {
                "text": "Use it on the locked door",
                "nextNodeID": "01"
            },
            {
                "text": "Give it to a nearby NPC",
                "nextNodeID": "02"
            }
        ]
    },
    {
        "id": "00",
        "text": "You find an ancient treasure hidden behind the wall.",
        "choices": [
            {
                "text": "Examine it closely",
                "nextNodeID": "000"
            },
            {
                "text": "Take it and run",
                "nextNodeID": "001"
            },
            {
                "text": "Leave it be",
                "nextNodeID": "002"
            }
        ]
    },
    {
        "id": "000",
        "text": "You notice an intricate map etched into the treasure, leading to more hidden riches. You grab the treasure and make a hasty escape, only to find yourself surrounded by traps.",
        "choices": [
            {
                "text": "Search for a way around",
                "nextNodeID": "0000"
            },
            {
                "text": "Disarm the traps",
                "nextNodeID": "0001"
            },
            {
                "text": "Abandon the treasure",
                "nextNodeID": "0002"
            }
        ]
    },
    {
        "id": "0000",
        "text": "You find an alternative path and make your escape."
    },
    {
        "id": "0001",
        "text": "With skillful hands, you disarm all the traps and claim the hidden riches."
    },
    {
        "id": "0002",
        "text": "Leaving the treasure behind, you sneak away unnoticed."
    },
    {
        "id": "001",
        "text": "Upon closer inspection, you realize that this is not gold or jewels but merely a cleverly crafted decoy. The real treasure lies in the room next door.",
        "choices": [
            {
                "text": "Explore the room next door",
                "nextNodeID": "0010"
            },
            {
                "text": "Search for hidden clues around you",
                "nextNodeID": "0011"
            },
            {
                "text": "Ask your companions for their opinion",
                "nextNodeID": "0012"
            }
        ]
    },
    {
        "id": "0010",
        "text": "You find a map leading to the real treasure, but it's in another part of the castle and heavily guarded. You decide to come back later after gathering more resources."
    },
    {
        "id": "0011",
        "text": "The decoy was just a distraction set by your enemies who are hiding nearby waiting to ambush you. You manage to escape unharmed and alert the authorities about their location."
    },
    {
        "id": "0012",
        "text": "Your companions reveal that they were part of a treasure hunt competition, and this room was one of the challenges. They had already found the real treasure earlier but kept it a secret from you."
    },
    {
        "id": "002",
        "text": "You feel an overwhelming sense of responsibility towards preserving history and decide to contact an archaeologist for help. As it turns out, the treasure holds immense historical significance and leads you on a thrilling adventure through time.",
        "choices": [
            {
                "text": "Contact an archaeologist for more information",
                "nextNodeID": "0020"
            },
            {
                "text": "Start researching on your own",
                "nextNodeID": "0021"
            },
            {
                "text": "Ask a historian about the treasure's history",
                "nextNodeID": "0022"
            }
        ]
    },
    {
        "id": "0020",
        "text": "You discover that the artifact is crucial to understanding ancient civilizations and their ways of life. You embark on a journey filled with mystery, danger, and enlightenment."
    },
    {
        "id": "0021",
        "text": "Your research leads you down a rabbit hole of information. As you dig deeper, you find yourself entangled in conspiracies and dark secrets about the treasure's past. Will you uncover the truth or become another lost soul swallowed by history?"
    },
    {
        "id": "0022",
        "text": "The historian reveals that the treasure is connected to an ancient prophecy foretelling doom if it falls into the wrong hands. You must now decide whether to protect it at all costs, or risk humanity's fate for your own gain."
    },
    {
        "id": "01",
        "text": "The door creaks open, revealing a secret room with more keys and treasures inside.",
        "choices": [
            {
                "text": "Examine the keys",
                "nextNodeID": "010"
            },
            {
                "text": "Take a treasure",
                "nextNodeID": "011"
            },
            {
                "text": "Leave quietly",
                "nextNodeID": "012"
            }
        ]
    },
    {
        "id": "010",
        "text": "You find that this key opens a locked door further in your journey.",
        "choices": [
            {
                "text": "Explore the room behind the door",
                "nextNodeID": "0100"
            },
            {
                "text": "Use the key to unlock another door elsewhere",
                "nextNodeID": "0101"
            },
            {
                "text": "Give the key to a character you meet",
                "nextNodeID": "0102"
            }
        ]
    },
    {
        "id": "0100",
        "text": "You discover valuable treasure in the room and can now continue your journey with more resources."
    },
    {
        "id": "0101",
        "text": "You find an important clue that leads you closer to your ultimate goal, but must first overcome new obstacles."
    },
    {
        "id": "0102",
        "text": "The character you give the key to becomes your loyal ally for the rest of your adventure."
    },
    {
        "id": "011",
        "text": "The shiny new item adds to your collection, but it weighs you down.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "0110"
            },
            {
                "text": "Abandon your find",
                "nextNodeID": "0111"
            },
            {
                "text": "Keep it close",
                "nextNodeID": "0112"
            }
        ]
    },
    {
        "id": "0110",
        "text": "You discover a hidden room filled with treasure."
    },
    {
        "id": "0111",
        "text": "The item mysteriously disappears, but you feel lighter."
    },
    {
        "id": "0112",
        "text": "The weight of the item causes an accident and sets back your progress."
    },
    {
        "id": "012",
        "text": "As you slip away unnoticed, you hear whispers from behind the walls.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "0120"
            },
            {
                "text": "Run away",
                "nextNodeID": "0121"
            },
            {
                "text": "Confront them directly",
                "nextNodeID": "0122"
            }
        ]
    },
    {
        "id": "0120",
        "text": "You discover a hidden passage leading to an ancient library."
    },
    {
        "id": "0121",
        "text": "As you flee, you stumble upon a secret map revealing the location of a powerful artifact."
    },
    {
        "id": "0122",
        "text": "The whispers grow louder and more ominous as they reveal themselves to be guardians of a forbidden treasure."
    },
    {
        "id": "02",
        "text": "The NPC thanks you and gives you a magical map that points the way to a hidden chamber.",
        "choices": [
            {
                "text": "Follow the map exactly",
                "nextNodeID": "020"
            },
            {
                "text": "Ask the NPC for more details",
                "nextNodeID": "021"
            },
            {
                "text": "Ignore the map and trust your instincts",
                "nextNodeID": "022"
            }
        ]
    },
    {
        "id": "020",
        "text": "The hidden chamber is revealed to be a treasure trove filled with ancient artifacts.",
        "choices": [
            {
                "text": "Examine the artifacts",
                "nextNodeID": "0200"
            },
            {
                "text": "Take an artifact",
                "nextNodeID": "0201"
            },
            {
                "text": "Leave the chamber",
                "nextNodeID": "0202"
            }
        ]
    },
    {
        "id": "0200",
        "text": "You discover that the artifacts are cursed and your character is turned into a mummy."
    },
    {
        "id": "0201",
        "text": "One of the artifacts was a magical map leading you to a hidden treasure. You find it!"
    },
    {
        "id": "0202",
        "text": "As soon as you leave, the entrance seals shut behind you."
    },
    {
        "id": "021",
        "text": "The NPC explains that there's a trap inside, but you can avoid it if you know the secret phrase.",
        "choices": [
            {
                "text": "Ask NPC for secret phrase",
                "nextNodeID": "0210"
            },
            {
                "text": "Try to disarm trap without knowing phrase",
                "nextNodeID": "0211"
            },
            {
                "text": "Run away from the room",
                "nextNodeID": "0212"
            }
        ]
    },
    {
        "id": "0210",
        "text": "You successfully avoid the trap and continue on your adventure."
    },
    {
        "id": "0211",
        "text": "The trap goes off, causing minor injuries. You can still continue with a slight limp."
    },
    {
        "id": "0212",
        "text": "In trying to escape, you trip over an obstacle and are caught by the guard."
    },
    {
        "id": "022",
        "text": "You stumble upon an old temple where a wise sage resides. He offers to guide you through his labyrinthine library.",
        "choices": [
            {
                "text": "Explore the library",
                "nextNodeID": "0220"
            },
            {
                "text": "Ask the sage for guidance",
                "nextNodeID": "0221"
            },
            {
                "text": "Leave immediately",
                "nextNodeID": "0222"
            }
        ]
    },
    {
        "id": "0220",
        "text": "You find a hidden map leading to a treasure."
    },
    {
        "id": "0221",
        "text": "The sage reveals an ancient prophecy about your destiny."
    },
    {
        "id": "0222",
        "text": "As you leave, you hear a loud rumble and realize the temple is collapsing."
    },
    {
        "id": "1",
        "text": "No one responds, but you hear footsteps approaching.",
        "choices": [
            {
                "text": "Follow the footsteps",
                "nextNodeID": "10"
            },
            {
                "text": "Wait and hide",
                "nextNodeID": "11"
            },
            {
                "text": "Run away",
                "nextNodeID": "12"
            }
        ]
    },
    {
        "id": "10",
        "text": "You follow the footsteps to a hidden door. What lies beyond remains unknown.",
        "choices": [
            {
                "text": "Open the door",
                "nextNodeID": "100"
            },
            {
                "text": "Listen carefully for any sounds",
                "nextNodeID": "101"
            },
            {
                "text": "Turn back and leave",
                "nextNodeID": "102"
            }
        ]
    },
    {
        "id": "100",
        "text": "You open the door to reveal a dark room with an old chest in the center. Inside is a dusty journal.",
        "choices": [
            {
                "text": "Open the chest",
                "nextNodeID": "1000"
            },
            {
                "text": "Read the journal",
                "nextNodeID": "1001"
            },
            {
                "text": "Leave the room",
                "nextNodeID": "1002"
            }
        ]
    },
    {
        "id": "1000",
        "text": "You find a map and some old coins inside the chest. You continue your adventure with these newfound treasures."
    },
    {
        "id": "1001",
        "text": "The journal reveals clues about hidden passages in the castle. You follow them to discover a secret library filled with ancient knowledge."
    },
    {
        "id": "1002",
        "text": "As you turn away, the door slams shut behind you. Trapped in darkness, you must find another way out or risk being lost forever."
    },
    {
        "id": "101",
        "text": "You hear whispers coming from behind the door, but can't make out what they are saying. You decide to continue forward anyway.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "1010"
            },
            {
                "text": "Ask for help from another character",
                "nextNodeID": "1011"
            },
            {
                "text": "Quickly open the door and enter",
                "nextNodeID": "1012"
            }
        ]
    },
    {
        "id": "1010",
        "text": "You discover a hidden room filled with valuable treasures."
    },
    {
        "id": "1011",
        "text": "Another character joins you, providing guidance through the mysterious whispers."
    },
    {
        "id": "1012",
        "text": "As you step inside, the whispers grow louder but reveal no clear meaning."
    },
    {
        "id": "102",
        "text": "As you turn back and leave, you feel as though someone or something is watching you.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "1020"
            },
            {
                "text": "Run away quickly",
                "nextNodeID": "1021"
            },
            {
                "text": "Stay calm and turn around",
                "nextNodeID": "1022"
            }
        ]
    },
    {
        "id": "1020",
        "text": "You discover a hidden entrance to an underground lair."
    },
    {
        "id": "1021",
        "text": "You trip and fall, alerting the pursuer. Game over."
    },
    {
        "id": "1022",
        "text": "The presence disappears as you confront it directly."
    },
    {
        "id": "11",
        "text": "As you wait, the person or creature approaches. You must fight or reason with them in order to continue your journey.",
        "choices": [
            {
                "text": "Attack",
                "nextNodeID": "110"
            },
            {
                "text": "Negotiate peacefully",
                "nextNodeID": "111"
            },
            {
                "text": "Run away",
                "nextNodeID": "112"
            }
        ]
    },
    {
        "id": "110",
        "text": "You engage in a fierce battle and manage to defeat the enemy. You continue on your journey.",
        "choices": [
            {
                "text": "Explore the nearby ruins",
                "nextNodeID": "1100"
            },
            {
                "text": "Follow the river downstream",
                "nextNodeID": "1101"
            },
            {
                "text": "Ask a passing traveler for directions",
                "nextNodeID": "1102"
            }
        ]
    },
    {
        "id": "1100",
        "text": "You discover an ancient artifact that reveals the location of a hidden treasure."
    },
    {
        "id": "1101",
        "text": "You come across a mysterious temple, where you find valuable clues about your ultimate goal."
    },
    {
        "id": "1102",
        "text": "The traveler leads you to a secret path that takes you directly to your destination."
    },
    {
        "id": "111",
        "text": "After some calm words, the creature allows you to pass without any further issues. You continue on your journey.",
        "choices": [
            {
                "text": "Explore the creature's cave",
                "nextNodeID": "1110"
            },
            {
                "text": "Follow the path deeper into the forest",
                "nextNodeID": "1111"
            },
            {
                "text": "Return the way you came",
                "nextNodeID": "1112"
            }
        ]
    },
    {
        "id": "1110",
        "text": "You discover a hidden treasure within the cave."
    },
    {
        "id": "1111",
        "text": "The path leads to an abandoned village with clues about your quest."
    },
    {
        "id": "1112",
        "text": "As you turn back, the creature reappears and blocks your way."
    },
    {
        "id": "112",
        "text": "In your haste to escape, you trip over a nearby rock and fall, giving away your position. The creature spots you easily and chases after you.",
        "choices": [
            {
                "text": "Run towards the forest",
                "nextNodeID": "1120"
            },
            {
                "text": "Climb up the nearest tree",
                "nextNodeID": "1121"
            },
            {
                "text": "Try to hide behind a large boulder",
                "nextNodeID": "1122"
            }
        ]
    },
    {
        "id": "1120",
        "text": "You manage to escape into the safety of the woods, but you can hear the creature's growls getting fainter in the distance."
    },
    {
        "id": "1121",
        "text": "The creature reaches you before you can climb too high and snatches you from your perch. Game over."
    },
    {
        "id": "1122",
        "text": "You remain hidden until nightfall when the creature returns to its den. You continue on your journey."
    },
    {
        "id": "12",
        "text": "Running away leads you into an unfamiliar area where danger lurks around every corner.",
        "choices": [
            {
                "text": "Find shelter",
                "nextNodeID": "120"
            },
            {
                "text": "Face your fears",
                "nextNodeID": "121"
            },
            {
                "text": "Keep running",
                "nextNodeID": "122"
            }
        ]
    },
    {
        "id": "120",
        "text": "You find a hidden cave and take refuge.",
        "choices": [
            {
                "text": "Explore deeper into the cave",
                "nextNodeID": "1200"
            },
            {
                "text": "Set up camp outside the entrance",
                "nextNodeID": "1201"
            },
            {
                "text": "Return to civilization for help",
                "nextNodeID": "1202"
            }
        ]
    },
    {
        "id": "1200",
        "text": "You discover a hidden treasure deep within the cave, but it's guarded by a fierce dragon."
    },
    {
        "id": "1201",
        "text": "As night falls, you notice strange symbols on nearby rocks. They seem to be guiding you towards another secret location."
    },
    {
        "id": "1202",
        "text": "With the help of the townsfolk, you are able to find and defeat the creature that had been terrorizing your village."
    },
    {
        "id": "121",
        "text": "Your bravery pays off as you outsmart the dangers around you.",
        "choices": [
            {
                "text": "Explore deeper into the cave",
                "nextNodeID": "1210"
            },
            {
                "text": "Ask for directions from a passing traveler",
                "nextNodeID": "1211"
            },
            {
                "text": "Retrace your steps and return to camp",
                "nextNodeID": "1212"
            }
        ]
    },
    {
        "id": "1210",
        "text": "You find an ancient artifact that leads you closer to your goal."
    },
    {
        "id": "1211",
        "text": "The traveler points you in the direction of a hidden passage, leading you safely past the dangers."
    },
    {
        "id": "1212",
        "text": "Upon returning to camp, you discover that the danger has passed and you can now proceed with caution."
    },
    {
        "id": "122",
        "text": "Running leads to an unexpected ally who helps you navigate through the danger.",
        "choices": [
            {
                "text": "Explore an abandoned warehouse",
                "nextNodeID": "1220"
            },
            {
                "text": "Follow a mysterious stranger",
                "nextNodeID": "1221"
            },
            {
                "text": "Ask for help from a nearby village",
                "nextNodeID": "1222"
            }
        ]
    },
    {
        "id": "1220",
        "text": "You find a hidden map inside the warehouse, leading you to valuable resources."
    },
    {
        "id": "1221",
        "text": "The mysterious stranger turns out to be a skilled fighter who joins your team and helps defeat the enemy."
    },
    {
        "id": "1222",
        "text": "The villagers provide shelter and information about the danger's origin. You devise a plan together."
    },
    {
        "id": "2",
        "text": "You hear the sound of a ticking clock. It's coming from somewhere nearby.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "20"
            },
            {
                "text": "Ignore it for now",
                "nextNodeID": "21"
            },
            {
                "text": "Follow the sound",
                "nextNodeID": "22"
            }
        ]
    },
    {
        "id": "20",
        "text": "You find a hidden room filled with ancient artifacts.",
        "choices": [
            {
                "text": "Examine the artifacts",
                "nextNodeID": "200"
            },
            {
                "text": "Touch the mysterious object",
                "nextNodeID": "201"
            },
            {
                "text": "Leave the room immediately",
                "nextNodeID": "202"
            }
        ]
    },
    {
        "id": "200",
        "text": "You discover an ancient map revealing a hidden treasure.",
        "choices": [
            {
                "text": "Follow the map",
                "nextNodeID": "2000"
            },
            {
                "text": "Ignore the map and keep exploring",
                "nextNodeID": "2001"
            },
            {
                "text": "Ask someone for help",
                "nextNodeID": "2002"
            }
        ]
    },
    {
        "id": "2000",
        "text": "You follow the map and find a hidden cave. Inside you discover an ancient chest filled with gold coins, jewels, and precious artifacts."
    },
    {
        "id": "2001",
        "text": "As you continue to explore, you stumble upon another map that leads you to an even greater treasure. You decide to keep this new map for future use."
    },
    {
        "id": "2002",
        "text": "After asking around, you manage to find someone who has knowledge of the area's history. They guide you to a secret location where you uncover the hidden treasure."
    },
    {
        "id": "201",
        "text": "The mysterious object starts glowing and transports you to another dimension.",
        "choices": [
            {
                "text": "Explore the new dimension",
                "nextNodeID": "2010"
            },
            {
                "text": "Ask for help from a mysterious figure",
                "nextNodeID": "2011"
            },
            {
                "text": "Run away and hide",
                "nextNodeID": "2012"
            }
        ]
    },
    {
        "id": "2010",
        "text": "You discover an ancient civilization that needs your help to defeat an evil force."
    },
    {
        "id": "2011",
        "text": "The mysterious figure reveals itself as a powerful being who grants you one wish, which changes everything about your life."
    },
    {
        "id": "2012",
        "text": "You eventually find your way back home, but with no memory of the adventure."
    },
    {
        "id": "202",
        "text": "As soon as you leave, the door slams shut behind you.",
        "choices": [
            {
                "text": "Explore left",
                "nextNodeID": "2020"
            },
            {
                "text": "Search for clues",
                "nextNodeID": "2021"
            },
            {
                "text": "Knock on door",
                "nextNodeID": "2022"
            }
        ]
    },
    {
        "id": "2020",
        "text": "You find a hidden passage leading to an ancient library."
    },
    {
        "id": "2021",
        "text": "You discover crucial evidence that leads you closer to your goal."
    },
    {
        "id": "2022",
        "text": "The owner of the house welcomes you in and offers help."
    },
    {
        "id": "21",
        "text": "The ticking stops and you feel relieved, but curious about its origin.",
        "choices": [
            {
                "text": "Investigate the ticking object",
                "nextNodeID": "210"
            },
            {
                "text": "Ask someone nearby about it",
                "nextNodeID": "211"
            },
            {
                "text": "Ignore it and continue on your journey",
                "nextNodeID": "212"
            }
        ]
    },
    {
        "id": "210",
        "text": "You discover that the ticking is coming from a bomb, which was set to go off in ten minutes. You must now find a way to disarm it or evacuate the area.",
        "choices": [
            {
                "text": "Search for the bomb's manual",
                "nextNodeID": "2100"
            },
            {
                "text": "Evacuate everyone from the area",
                "nextNodeID": "2101"
            },
            {
                "text": "Call an expert",
                "nextNodeID": "2102"
            }
        ]
    },
    {
        "id": "2100",
        "text": "You successfully disarm the bomb using the instructions in the manual, averting disaster."
    },
    {
        "id": "2101",
        "text": "Everyone is safely evacuated before the bomb goes off. However, you lose valuable information that could have been useful for future missions."
    },
    {
        "id": "2102",
        "text": "The expert arrives just in time and skillfully defuses the bomb, saving everyone."
    },
    {
        "id": "211",
        "text": "Someone tells you that the ticking sound comes from an old grandfather clock in the room next door. You can either retrieve the key and check it out, ask someone else for help, or leave it alone and continue on your journey.",
        "choices": [
            {
                "text": "Investigate the clock",
                "nextNodeID": "2110"
            },
            {
                "text": "Ask for help from another character",
                "nextNodeID": "2111"
            },
            {
                "text": "Ignore the ticking sound and continue",
                "nextNodeID": "2112"
            }
        ]
    },
    {
        "id": "2110",
        "text": "You discover a hidden room containing valuable treasures."
    },
    {
        "id": "2111",
        "text": "Another character reveals a secret passage to your ultimate goal."
    },
    {
        "id": "2112",
        "text": "The ticking turns out to be a trap, and you are ambushed by enemies."
    },
    {
        "id": "212",
        "text": "As you ignore the ticking object, it suddenly stops. You feel a sense of relief but also wonder what could have caused such a strange occurrence.",
        "choices": [
            {
                "text": "Investigate the ticking object",
                "nextNodeID": "2120"
            },
            {
                "text": "Leave it alone and continue exploring",
                "nextNodeID": "2121"
            },
            {
                "text": "Attempt to disarm or destroy the object",
                "nextNodeID": "2122"
            }
        ]
    },
    {
        "id": "2120",
        "text": "You discover that the object is a time bomb set to go off in five minutes. You quickly search for any clues on how to defuse it, but there's no time left! The explosion destroys everything around you."
    },
    {
        "id": "2121",
        "text": "As you delve deeper into the mysterious mansion, you stumble upon an ancient artifact that holds the key to solving the adventure. Your curiosity leads you to uncover a hidden treasure room and claim your prize."
    },
    {
        "id": "2122",
        "text": "You successfully disarm the object, preventing any harm from coming to yourself or others. As it turns out, the ticking was just a loose gear in need of lubrication."
    },
    {
        "id": "22",
        "text": "The source of the ticking is revealed to be an old grandfather clock.",
        "choices": [
            {
                "text": "Investigate the clock",
                "nextNodeID": "220"
            },
            {
                "text": "Ask the owner about it",
                "nextNodeID": "221"
            },
            {
                "text": "Ignore it for now",
                "nextNodeID": "222"
            }
        ]
    },
    {
        "id": "220",
        "text": "You discover a hidden room behind the clock.",
        "choices": [
            {
                "text": "Explore the room",
                "nextNodeID": "2200"
            },
            {
                "text": "Search for clues",
                "nextNodeID": "2201"
            },
            {
                "text": "Ignore it",
                "nextNodeID": "2202"
            }
        ]
    },
    {
        "id": "2200",
        "text": "You find a hidden treasure and escape the maze."
    },
    {
        "id": "2201",
        "text": "You uncover a secret passage leading to another part of the castle."
    },
    {
        "id": "2202",
        "text": "The mysterious room turns out to be empty, but you hear strange noises coming from somewhere else."
    },
    {
        "id": "221",
        "text": "The owner tells you an old legend of the cursed timepiece.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "2210"
            },
            {
                "text": "Ask for more details",
                "nextNodeID": "2211"
            },
            {
                "text": "Leave immediately",
                "nextNodeID": "2212"
            }
        ]
    },
    {
        "id": "2210",
        "text": "You discover that the timepiece is indeed cursed and has caused misfortune to all who have owned it. You decide to take possession of it, hoping to break the curse."
    },
    {
        "id": "2211",
        "text": "The owner reveals a hidden compartment in the timepiece containing an ancient artifact said to protect against dark magic. You choose to keep this artifact for yourself."
    },
    {
        "id": "2212",
        "text": "As you leave, you hear a loud crash from within the house. You never return and spread word about the cursed timepiece."
    },
    {
        "id": "222",
        "text": "As you continue, the ticking becomes louder.",
        "choices": [
            {
                "text": "Explore further",
                "nextNodeID": "2220"
            },
            {
                "text": "Turn back immediately",
                "nextNodeID": "2221"
            },
            {
                "text": "Investigate the source of the ticking",
                "nextNodeID": "2222"
            }
        ]
    },
    {
        "id": "2220",
        "text": "You find a hidden passage leading deeper into the maze."
    },
    {
        "id": "2221",
        "text": "As you retreat, you hear a loud explosion behind you."
    },
    {
        "id": "2222",
        "text": "The ticking stops as you approach and you discover an ancient clockwork mechanism."
    },
    {
        "depth": 4,
        "title": "The Dark Room Story"
    }
]