[
    {
        "id": "",
        "text": "You're on lunch break and waiting in the line of your favorite deli. Break ends in two minutes, and the line seems like it's going to take forever to end especially because the family at its front is taking forever to decide what they want.",
        "choices": [
            {
                "text": "Ask the family if they need help choosing,",
                "nextNodeID": "0"
            },
            {
                "text": "Cut in line and hope for forgiveness later,",
                "nextNodeID": "1"
            },
            {
                "text": "Find an alternative lunch spot.",
                "nextNodeID": "2"
            }
        ]
    },
    {
        "id": "0",
        "text": "The family thanks you, and your break ends just as you get to the counter. You grab a sandwich quickly before rushing back to work.",
        "choices": [
            {
                "text": "Stay for lunch",
                "nextNodeID": "00"
            },
            {
                "text": "Quickly return to work without eating",
                "nextNodeID": "01"
            },
            {
                "text": "Take your sandwich on a short break",
                "nextNodeID": "02"
            }
        ]
    },
    {
        "id": "00",
        "text": "You sit down and enjoy the company of your coworkers while savoring every bite.",
        "choices": [
            {
                "text": "Take another bite",
                "nextNodeID": "000"
            },
            {
                "text": "Start talking to your coworkers",
                "nextNodeID": "001"
            },
            {
                "text": "Suddenly spot something strange out of the corner of your eye",
                "nextNodeID": "002"
            }
        ]
    },
    {
        "id": "000",
        "text": "You finish eating and strike up a conversation with your coworker about their weekend plans. The game continues."
    },
    {
        "id": "001",
        "text": "Your coworkers engage you in an interesting discussion, leading to new insights on the project at hand. The game continues."
    },
    {
        "id": "002",
        "text": "As you turn towards the strange object, it disappears into thin air. You feel uneasy but continue eating. The game continues with a sense of foreboding."
    },
    {
        "id": "01",
        "text": "Your manager notices you're back early from lunch, but you explain that you grabbed something quick. They understand and let it slide this time.",
        "choices": [
            {
                "text": "Go back to work",
                "nextNodeID": "010"
            },
            {
                "text": "Take a longer break next time",
                "nextNodeID": "011"
            },
            {
                "text": "Apologize sincerely",
                "nextNodeID": "012"
            }
        ]
    },
    {
        "id": "010",
        "text": "You return to your tasks, focusing on making up for lost time."
    },
    {
        "id": "011",
        "text": "Next time you take a lunch break, make sure it's long enough that your manager won't notice any discrepancies in your schedule."
    },
    {
        "id": "012",
        "text": "Your manager appreciates the honesty and doesn't bring up the issue again."
    },
    {
        "id": "02",
        "text": "During your short break, you find a hidden note in your sandwich - an invitation to join a secret society. You feel intrigued and decide to investigate further.",
        "choices": [
            {
                "text": "Investigate the secret society's headquarters",
                "nextNodeID": "020"
            },
            {
                "text": "Attend an upcoming meeting as a guest",
                "nextNodeID": "021"
            },
            {
                "text": "Ignore the invitation and continue your journey",
                "nextNodeID": "022"
            }
        ]
    },
    {
        "id": "020",
        "text": "You discover that the secret society is planning to overthrow the government, but they need more members. You decide to join them."
    },
    {
        "id": "021",
        "text": "At the meeting, you learn about their plans for world domination. Shocked by this revelation, you leave immediately and report the group's intentions to the authorities."
    },
    {
        "id": "022",
        "text": "As you continue your journey, you come across a hidden cave with an ancient artifact that holds the key to saving the world from certain doom."
    },
    {
        "id": "1",
        "text": "You apologize profusely to the family and explain that you're running late for work. They let you pass, but give you dirty looks. Your break ends with no time left for lunch.",
        "choices": [
            {
                "text": "Go back inside for lunch",
                "nextNodeID": "10"
            },
            {
                "text": "Apologize again and ask if you can join them for a meal",
                "nextNodeID": "11"
            },
            {
                "text": "Quickly grab something from your car to eat on the go",
                "nextNodeID": "12"
            }
        ]
    },
    {
        "id": "10",
        "text": "You sit down with the family, enjoying their company as they share stories of their day. You finish eating and thank them before heading back to work.",
        "choices": [
            {
                "text": "Investigate the mysterious noise",
                "nextNodeID": "100"
            },
            {
                "text": "Ask for more information about their day",
                "nextNodeID": "101"
            },
            {
                "text": "Offer to help them with a task",
                "nextNodeID": "102"
            }
        ]
    },
    {
        "id": "100",
        "text": "You discover it was just the wind, but you feel a strange sense of unease."
    },
    {
        "id": "101",
        "text": "They reveal that they found an old map leading to hidden treasure. You decide to join them on their search."
    },
    {
        "id": "102",
        "text": "The family thanks you for your assistance and invites you back for dinner again soon."
    },
    {
        "id": "11",
        "text": "The family reluctantly agrees, setting aside their displeasure for now. They invite you to join them at a nearby restaurant, where you bond over shared experiences and laughter. Eventually, you return to work feeling refreshed and recharged.",
        "choices": [
            {
                "text": "Decide to join them for dinner",
                "nextNodeID": "110"
            },
            {
                "text": "Decline their invitation politely",
                "nextNodeID": "111"
            },
            {
                "text": "Sneak away without telling anyone",
                "nextNodeID": "112"
            }
        ]
    },
    {
        "id": "110",
        "text": "You enjoy a delightful meal with the family and learn more about each other's lives, which strengthens your bond."
    },
    {
        "id": "111",
        "text": "The family respects your decision but feels slightly hurt that you didn't want to spend time with them. You return to work feeling somewhat guilty for not joining them."
    },
    {
        "id": "112",
        "text": "You slip away unnoticed while they are distracted, but later the family confronts you about it and expresses their disappointment."
    },
    {
        "id": "12",
        "text": "You jump in your car and speed off towards the office, a granola bar in hand. As you drive, you can't help but feel guilty for not spending more time with the family, knowing that this might affect future interactions.",
        "choices": [
            {
                "text": "Pull over and call your family",
                "nextNodeID": "120"
            },
            {
                "text": "Continue driving without distraction",
                "nextNodeID": "121"
            },
            {
                "text": "Eat the granola bar",
                "nextNodeID": "122"
            }
        ]
    },
    {
        "id": "120",
        "text": "You realize that you can still make time for them later, and they understand. You arrive at work feeling less guilty."
    },
    {
        "id": "121",
        "text": "Upon arriving at work, you find out that an important project has been delayed due to a mistake made by your team. Your family life becomes even more strained as you struggle to catch up on lost time."
    },
    {
        "id": "122",
        "text": "You reach the office just in time for your meeting and give a presentation that impresses everyone. However, when you get home, your family is upset because they feel neglected."
    },
    {
        "id": "2",
        "text": "You find an empty deli around the corner and grab something quick. You make it back just in time before your break ends.",
        "choices": [
            {
                "text": "Head back to work",
                "nextNodeID": "20"
            },
            {
                "text": "Search for clues around the deli",
                "nextNodeID": "21"
            },
            {
                "text": "Ask a co-worker what they know",
                "nextNodeID": "22"
            }
        ]
    },
    {
        "id": "20",
        "text": "You return to your duties, but can't shake the feeling that something is off.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "200"
            },
            {
                "text": "Ask your superior for guidance",
                "nextNodeID": "201"
            },
            {
                "text": "Ignore your instincts and continue as normal",
                "nextNodeID": "202"
            }
        ]
    },
    {
        "id": "200",
        "text": "You discover a hidden plot to overthrow the kingdom."
    },
    {
        "id": "201",
        "text": "Your superior reveals they have been aware of the issue and are working on a solution."
    },
    {
        "id": "202",
        "text": "Nothing unusual is found, but you can't shake the feeling that something is still off."
    },
    {
        "id": "21",
        "text": "Behind a stack of boxes, you find an old blueprint with cryptic markings. You take it and continue on your adventure.",
        "choices": [
            {
                "text": "Investigate the markings further",
                "nextNodeID": "210"
            },
            {
                "text": "Follow the path indicated on the blueprint",
                "nextNodeID": "211"
            },
            {
                "text": "Discard the blueprint and continue exploring",
                "nextNodeID": "212"
            }
        ]
    },
    {
        "id": "210",
        "text": "The markings reveal a hidden passage leading to an ancient temple."
    },
    {
        "id": "211",
        "text": "You find yourself in front of a mysterious door with the same cryptic symbols as the blueprint, which opens revealing a secret room filled with treasure!"
    },
    {
        "id": "212",
        "text": "As you explore further, you stumble upon a group of adventurers who have also been searching for this place. They invite you to join their party and share your findings."
    },
    {
        "id": "22",
        "text": "Your coworker mentions they saw someone suspicious hanging around earlier. They give you a description to keep an eye out for.",
        "choices": [
            {
                "text": "Investigate further",
                "nextNodeID": "220"
            },
            {
                "text": "Ignore it for now",
                "nextNodeID": "221"
            },
            {
                "text": "Tell your supervisor immediately",
                "nextNodeID": "222"
            }
        ]
    },
    {
        "id": "220",
        "text": "You spot the suspicious person and manage to apprehend them, uncovering a major theft plot. Your coworker thanks you."
    },
    {
        "id": "221",
        "text": "The suspicious person disappears, but you later find out they were casing the place for an upcoming robbery. You wish you had acted sooner."
    },
    {
        "id": "222",
        "text": "Your supervisor takes charge of the situation, and you are commended for your vigilance. The company's security is tightened up as a result."
    },
    {
        "depth": 3,
        "title": "End of the Line"
    }
]