[
    {
        "id": "",
        "text": "You are in a dark room. You can't see anything.",
        "choices": [
            {
                "text": "\"Feel around the room.\"",
                "nextNodeID": "0"
            },
            {
                "text": "\"Shout for help.\"",
                "nextNodeID": "1"
            },
            {
                "text": "\"Try to remember how you got here.\"",
                "nextNodeID": "2"
            }
        ]
    },
    {
        "id": "0",
        "text": "\"You find a small object in your hand. It feels like a key.\"",
        "choices": [
            {
                "text": "\"Unlock the door.\"",
                "nextNodeID": "00"
            },
            {
                "text": "\"Ignore it for now.\"",
                "nextNodeID": "01"
            },
            {
                "text": "\"Try to sell or trade it.\"",
                "nextNodeID": "02"
            }
        ]
    },
    {
        "id": "00",
        "text": "\"You unlock the door and find yourself in an empty room with a single window at the far end. As you approach, you notice that there's something behind the glass - a treasure chest!\""
    },
    {
        "id": "01",
        "text": "\"Open the chest.\""
    },
    {
        "id": "02",
        "text": "\"Leave the chest untouched.\""
    },
    {
        "id": "1",
        "text": "\"No one answers, but you hear muffled voices and footsteps outside.\"",
        "choices": [
            {
                "text": "\"You decide to investigate further.\"",
                "nextNodeID": "10"
            },
            {
                "text": "\"You choose to hide and observe.\"",
                "nextNodeID": "11"
            },
            {
                "text": "\"You knock on the door to announce your presence.\"",
                "nextNodeID": "12"
            }
        ]
    },
    {
        "id": "10",
        "text": "\"If you decide to investigate further, you find out that it's just some neighbors having a party. You can either join them or continue with your original mission.\""
    },
    {
        "id": "11",
        "text": "\"If you choose to hide and observe, you notice a suspicious figure lurking around the corner. After they leave, you cautiously approach the house only to discover a hidden entrance leading underground.\""
    },
    {
        "id": "12",
        "text": "\"If you knock on the door to announce your presence, the person inside invites you in for tea, but as soon as you enter their home, you realize that it's a trap and must fight off the inhabitants before escaping.\""
    },
    {
        "id": "2",
        "text": "\"A memory flashes back: You were exploring an old abandoned house with some friends when the power went out.\"",
        "choices": [
            {
                "text": "\"Investigate the dark basement.\"",
                "nextNodeID": "20"
            },
            {
                "text": "\"Search for a way out of the house.\"",
                "nextNodeID": "21"
            },
            {
                "text": "\"Stay with your friends in the living room.\"",
                "nextNodeID": "22"
            }
        ]
    },
    {
        "id": "20",
        "text": "\"You descend into the dark, musty basement and find an old dust-covered journal. Reading it reveals clues to hidden treasures within the house.\""
    },
    {
        "id": "21",
        "text": "\"You stumble upon a secret door that leads you outside, allowing you to escape from the haunted house.\""
    },
    {
        "id": "22",
        "text": "\"As you huddle with your friends in fear, a ghostly apparition appears and begins speaking to you about its tragic past. You learn of an ancient curse placed on the house by a vengeful spirit.\""
    },
    {
        "depth": 2,
        "title": "Demo Title"
    }
]